In [258]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [234]:
df1 = pd.read_excel(r"D:\books\Copy of CSV_Matrix_2.0_Group_B_dataset(1).xlsx", sheet_name=1,skiprows=3, header=0)  
df1 = df1.drop(df1.columns[0], axis=1)
df1.columns = df1.columns.str.strip()
df1.head()

,team1,team2,match_number,venue,city,toss_winner,toss_decision,player_of_match,umpire1,umpire2,reserve_umpire,match_referee,match_type,extras,winner,looser,win_by_runs,win_by_wickets
0,Afghanistan,England,1,Narendra Modi Stadium,Ahmedabad,England,field,JE Root,HDPK Dharmasena,Nitin Menon,Sharfuddoula,J Srinath,Group,NaN,NaN,NaN,NaN,NaN
1,Sri Lanka,South Africa,2,Rajiv Gandhi International Stadium,Hyderabad,South Africa,field,KIC Asalanka,AT Holdstock,CM Brown,PR Reiffel,JJ Crowe,Group,NaN,NaN,NaN,NaN,NaN
2,Netherlands,Pakistan,3,Himachal Pradesh Cricket Association Stadium,Dharamsala,Pakistan,field,Babar Azam,JS Wilson,HDPK Dharmasena,M Erasmus,AJ Pycroft,Group,NaN,NaN,NaN,NaN,NaN
3,New Zealand,Bangladesh,4,Arun Jaitley Stadium,Delhi,Bangladesh,field,DJ Mitchell,RK Illingworth,Sharfuddoula,AG Wharf,J Srinath,Group,NaN,NaN,NaN,NaN,NaN
4,India,Australia,5,MA Chidambaram Stadium,Chennai,India,bat,GJ Maxwell,CB Gaffaney,RA Kettleborough,AT Holdstock,RB Richardson,Group,NaN,NaN,NaN,NaN,NaN

In [265]:
df2 = pd.read_excel(r"D:\books\Copy of CSV_Matrix_2.0_Group_B_dataset(1).xlsx", sheet_name=2,skiprows=3, header=0)
df2 = df2.drop(df2.columns[0], axis=1)
df2.head()

,match_id,innings,ball,batting_team,bowling_team,striker,non_striker,bowler,runs_off_bat,wides,noballs,byes,legbyes,penalty,wicket_type,player_dismissed
0,1,1,0.1,Afghanistan,England,Rahmanullah Gurbaz,Ibrahim Zadran,RJW Topley,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,1,1,0.2,Afghanistan,England,Rahmanullah Gurbaz,Ibrahim Zadran,RJW Topley,6,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,1,1,0.3,Afghanistan,England,Rahmanullah Gurbaz,Ibrahim Zadran,RJW Topley,1,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,1,1,0.4,Afghanistan,England,Ibrahim Zadran,Rahmanullah Gurbaz,RJW Topley,1,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,1,1,0.5,Afghanistan,England,Rahmanullah Gurbaz,Ibrahim Zadran,RJW Topley,4,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [24]:
df1.to_csv(r'D:\books\cleaned_data.csv', index=False)

In [26]:
df2.to_csv(r'D:\books\cleaned_data3.csv', index=False)

# Question 1

In [266]:
df2['extras'] = df2[['wides', 'noballs', 'byes', 'legbyes', 'penalty']].sum(axis=1)

match_extras = df2.groupby('match_id')['extras'].sum().reset_index()

In [237]:
match_extras.head()

   match_id  extras
0         1    14.0
1         2    18.0
2         3    16.0
3         4    43.0
4         5    20.0

In [267]:
innings_runs = df2.groupby(['match_id', 'innings', 'batting_team'])['runs_off_bat'].sum().reset_index()

innings_runs.rename(columns={'runs_off_bat': 'total_runs'}, inplace=True)

match_results = innings_runs.sort_values(by=['match_id', 'total_runs'], ascending=[True, False])

winners_losers = match_results.groupby('match_id').apply(lambda x: pd.Series({
    'winner': x.iloc[0]['batting_team'],
    'loser': x.iloc[1]['batting_team'] if len(x) > 1 else None,
    'win_by_runs': x.iloc[0]['total_runs'] - x.iloc[1]['total_runs'] if len(x) > 1 and x.iloc[0]['innings'] == 1 else None,
    'win_by_wickets': 10 - df2[(df2['match_id'] == x.name) & (df2['innings'] == 2) & (df2['batting_team'] == x.iloc[0]['batting_team'])]['wicket_type'].count()
})).reset_index()

winners_losers['win_by_wickets'] = winners_losers.apply(lambda row: row['win_by_wickets'] if pd.isna(row['win_by_runs']) else None, axis=1)
winners_losers.head()

   match_id       winner         loser  win_by_runs  win_by_wickets
0         1  Afghanistan       England          1.0             NaN
1         2    Sri Lanka  South Africa         81.0             NaN
2         3     Pakistan   Netherlands          NaN             6.0
3         4  New Zealand    Bangladesh         99.0             NaN
4         5    Australia         India          NaN             6.0

In [268]:
match_results.head()

   match_id  innings  batting_team  total_runs
0         1        1   Afghanistan         276
1         1        2       England         275
2         2        1     Sri Lanka         277
3         2        2  South Africa         196
5         3        2      Pakistan         150

# Question 3

In [272]:
df1 = df1.merge(winners_losers, left_on='match_number', right_on='match_id', how='left', suffixes=('', '_new'))
df1 = df1.loc[:, ~df1.columns.duplicated()]

df1['winner'] = df1['winner_new'].fillna(df1['winner'])
df1['loser'] = df1['loser_new'].fillna(df1['loser'])
df1['win_by_runs'] = df1['win_by_runs_new'].fillna(df1['win_by_runs'])
df1['win_by_wickets'] = df1['win_by_wickets_new'].fillna(df1['win_by_wickets'])
df1.drop(columns=['winner_new','looser', 'match_id','loser_new', 'win_by_runs_new', 'win_by_wickets_new', 'match_id_new'], inplace=True, errors='ignore')

In [273]:

df1 = df1.merge(match_extras, left_on='match_number', right_on='match_id', how='left', suffixes=('', '_new'))

df1['extras'] = df1['extras_new'].combine_first(df1['extras'])

df1.drop(columns=['extras_new', 'match_id'], inplace=True)

df1.head()

,team1,team2,match_number,venue,city,toss_winner,toss_decision,player_of_match,umpire1,umpire2,reserve_umpire,match_referee,match_type,extras,winner,win_by_runs,win_by_wickets,loser
0,Afghanistan,England,1,Narendra Modi Stadium,Ahmedabad,England,field,JE Root,HDPK Dharmasena,Nitin Menon,Sharfuddoula,J Srinath,Group,14.0,Afghanistan,1.0,NaN,England
1,Sri Lanka,South Africa,2,Rajiv Gandhi International Stadium,Hyderabad,South Africa,field,KIC Asalanka,AT Holdstock,CM Brown,PR Reiffel,JJ Crowe,Group,18.0,Sri Lanka,81.0,NaN,South Africa
2,Netherlands,Pakistan,3,Himachal Pradesh Cricket Association Stadium,Dharamsala,Pakistan,field,Babar Azam,JS Wilson,HDPK Dharmasena,M Erasmus,AJ Pycroft,Group,16.0,Pakistan,NaN,6.0,Netherlands
3,New Zealand,Bangladesh,4,Arun Jaitley Stadium,Delhi,Bangladesh,field,DJ Mitchell,RK Illingworth,Sharfuddoula,AG Wharf,J Srinath,Group,43.0,New Zealand,99.0,NaN,Bangladesh
4,India,Australia,5,MA Chidambaram Stadium,Chennai,India,bat,GJ Maxwell,CB Gaffaney,RA Kettleborough,AT Holdstock,RB Richardson,Group,20.0,Australia,NaN,6.0,India

In [274]:
group_stage_matches = df1[df1['match_type'] == 'Group']

matches_team1 = group_stage_matches['team1'].value_counts()
matches_team2 = group_stage_matches['team2'].value_counts()


matches_played = matches_team1.add(matches_team2, fill_value=0)


matches_played_df = matches_played.reset_index()
matches_played_df.columns = ['Team', 'Matches Played']

In [275]:
matches_played_df.head()

          Team  Matches Played
0  Afghanistan               9
1    Australia               9
2   Bangladesh               9
3      England               9
4        India               9

In [276]:
matches_won = group_stage_matches['winner'].value_counts()

matches_won_df = matches_won.reset_index()
matches_won_df.columns = ['Team', 'Matches Won']

In [277]:
matches_won_df

           Team  Matches Won
0     Australia            9
1         India            7
2   New Zealand            6
3       England            5
4   Afghanistan            4
5    Bangladesh            4
6   Netherlands            4
7     Sri Lanka            3
8  South Africa            2
9      Pakistan            1

In [278]:
matches_lost = group_stage_matches['loser'].value_counts()

matches_lost_df = matches_lost.reset_index()
matches_lost_df.columns = ['Team', 'Matches Lost']
matches_lost_df

           Team  Matches Lost
0      Pakistan             8
1  South Africa             7
2     Sri Lanka             6
3   Netherlands             5
4    Bangladesh             5
5   Afghanistan             5
6       England             4
7   New Zealand             3
8         India             2

In [282]:
extras_given = pd.DataFrame()

team1_extras = group_stage_matches[['team1', 'extras']].copy()
team1_extras.columns = ['Team', 'Extras']
team1_extras['Type'] = 'Team1'


team2_extras = group_stage_matches[['team2', 'extras']].copy()
team2_extras.columns = ['Team', 'Extras']
team2_extras['Type'] = 'Team2'


extras_combined = pd.concat([team1_extras, team2_extras], ignore_index=True)


total_extras = extras_combined.groupby('Team')['Extras'].sum().reset_index()
total_extras

           Team  Extras
0   Afghanistan   189.0
1     Australia   187.0
2    Bangladesh   253.0
3       England   181.0
4         India   247.0
5   Netherlands   219.0
6   New Zealand   286.0
7      Pakistan   176.0
8  South Africa   254.0
9     Sri Lanka   242.0

In [288]:
merged_df = pd.merge(group_stage_matches, df2, left_on='match_number', right_on='match_id', how='left')

merged_df['total_runs'] = merged_df['runs_off_bat'] + merged_df['extras_x']


total_runs = pd.DataFrame()

team1_runs = merged_df.groupby('team1')['total_runs'].sum().reset_index()
team1_runs.columns = ['Team', 'Total_Runs']


team2_runs = merged_df.groupby('team2')['total_runs'].sum().reset_index()
team2_runs.columns = ['Team', 'Total_Runs']


total_runs_combined = pd.concat([team1_runs, team2_runs], ignore_index=True)


total_runs_final = total_runs_combined.groupby('Team')['Total_Runs'].sum().reset_index()


team1_extras = group_stage_matches[['team1', 'extras']].copy()
team1_extras.columns = ['Team', 'Extras']
team1_extras['Type'] = 'Team1'

team2_extras = group_stage_matches[['team2', 'extras']].copy()
team2_extras.columns = ['Team', 'Extras']
team2_extras['Type'] = 'Team2'


extras_combined = pd.concat([team1_extras, team2_extras], ignore_index=True)


total_extras = extras_combined.groupby('Team')['Extras'].sum().reset_index()


result = pd.merge(total_runs_final, total_extras, on='Team', how='left')
result['% Extras'] = (result['Extras'] / result['Total_Runs']) * 100

In [289]:
result

           Team  Total_Runs  Extras  % Extras
0   Afghanistan    104850.0   189.0  0.180258
1     Australia    102366.0   187.0  0.182678
2    Bangladesh    145240.0   253.0  0.174194
3       England    104051.0   181.0  0.173953
4         India    145971.0   247.0  0.169212
5   Netherlands    125020.0   219.0  0.175172
6   New Zealand    162296.0   286.0  0.176221
7      Pakistan    102402.0   176.0  0.171872
8  South Africa    145880.0   254.0  0.174116
9     Sri Lanka    142182.0   242.0  0.170204

In [251]:
results_list = []


for team in group_stage_matches['winner'].unique():
    matches_played = group_stage_matches[(group_stage_matches['team1'] == team) | (group_stage_matches['team2'] == team)].shape[0]
    matches_won = group_stage_matches[group_stage_matches['winner'] == team].shape[0]
    extras_given = group_stage_matches[(group_stage_matches['team1'] == team) | (group_stage_matches['team2'] == team)]['extras'].sum()
    
 
    runs_scored = group_stage_matches[group_stage_matches['winner'] == team]['win_by_runs'].sum()
    runs_conceded = group_stage_matches[group_stage_matches['loser'] == team]['win_by_runs'].sum() + group_stage_matches[group_stage_matches['loser'] == team]['extras'].sum()
    

    overs_faced = group_stage_matches[group_stage_matches['winner'] == team]['extras'].sum()
    overs_bowled = group_stage_matches[group_stage_matches['loser'] == team]['extras'].sum()


    nrr_for = runs_scored / overs_faced if overs_faced > 0 else 0
    nrr_against = runs_conceded / overs_bowled if overs_bowled > 0 else 0
    nrr = nrr_for - nrr_against
    
   
    results_list.append({
        'Team': team,
        'Matches Played': matches_played,
        'Matches Won': matches_won,
        'Extras Given': extras_given,
        'NRR For': nrr_for,
        'NRR Against': nrr_against,
        'NRR': nrr
    })

results = pd.DataFrame(results_list)
results

,Team,Matches Played,Matches Won,Extras Given,NRR For,NRR Against,NRR
0,Afghanistan,9,4,189.0,4.451220,5.056075,-0.604855
1,Sri Lanka,9,3,242.0,1.154930,2.906433,-1.751503
2,Pakistan,9,1,176.0,0.000000,3.418750,-3.418750
3,New Zealand,9,6,286.0,4.561798,3.166667,1.395131
4,Australia,9,9,187.0,4.117647,0.000000,4.117647
5,England,9,5,181.0,4.693182,3.290323,1.402859
6,Bangladesh,9,4,253.0,0.175182,4.370690,-4.195507
7,Netherlands,9,4,219.0,0.650485,2.241379,-1.590894
8,India,9,7,247.0,2.126904,3.760000,-1.633096
9,South Africa,9,2,254.0,1.637931,4.979592,-3.341661

# Question 5

In [260]:


df2 = df2.drop(columns=[df2.columns[0]])

df2['runs_off_bat'] = pd.to_numeric(df2['runs_off_bat'], errors='coerce')
df2['ball'] = pd.to_numeric(df2['ball'], errors='coerce')
df2['wides'] = pd.to_numeric(df2['wides'], errors='coerce')
df2['noballs'] = pd.to_numeric(df2['noballs'], errors='coerce')
df2['byes'] = pd.to_numeric(df2['byes'], errors='coerce')
df2['legbyes'] = pd.to_numeric(df2['legbyes'], errors='coerce')


def get_over(ball):
    try:
        return int(float(ball))
    except:
        return None

def is_third_powerplay(ball):
    over = get_over(ball)
    return 40 < over <= 50 if over is not None else False


df2['over'] = df2['ball'].apply(get_over)
df2['is_third_powerplay'] = df2['over'].apply(lambda x: 40 < x <= 50 if x is not None else False)


def calculate_powerplay_stats(df, batting_first=None):
    powerplay_data = df[df['is_third_powerplay']]
    if batting_first is not None:
        powerplay_data = powerplay_data[powerplay_data['innings'] == (1 if batting_first else 2)]
    
    team_stats = []
    for team in powerplay_data['batting_team'].unique():
        team_data = powerplay_data[powerplay_data['batting_team'] == team]
        
        
        total_runs = (team_data['runs_off_bat'].fillna(0) + 
                     team_data['wides'].fillna(0) + 
                     team_data['noballs'].fillna(0) + 
                     team_data['byes'].fillna(0) + 
                     team_data['legbyes'].fillna(0)).sum()
        
        
        legal_deliveries = len(team_data) - team_data['wides'].fillna(0).sum() - team_data['noballs'].fillna(0).sum()
        overs = legal_deliveries / 6
        
       
        wickets = team_data['wicket_type'].notna().sum()
        avg_balls_per_wicket = legal_deliveries / wickets if wickets > 0 else float('inf')
        
        team_stats.append({
            'Team': team,
            'Run Rate': round(total_runs / overs if overs > 0 else 0, 2),
            'Wickets': wickets,
            'Avg Balls per Wicket': round(avg_balls_per_wicket, 2) if avg_balls_per_wicket != float('inf') else 'N/A'
        })
    
    return pd.DataFrame(team_stats)

overall_stats = calculate_powerplay_stats(df2)
batting_first_stats = calculate_powerplay_stats(df2, batting_first=True)
batting_second_stats = calculate_powerplay_stats(df2, batting_first=False)

print("\
Overall Third Powerplay Statistics:")
print(overall_stats)
print("\
Batting First Statistics:")
print(batting_first_stats)
print("\
Batting Second Statistics:")
print(batting_second_stats)

Overall Third Powerplay Statistics:
           Team  Run Rate  Wickets  Avg Balls per Wicket
0   Afghanistan      8.85       21                 12.05
1     Sri Lanka      7.84       18                 12.89
2   New Zealand     10.64       19                 21.37
3    Bangladesh      5.16       17                 16.00
4         India      8.01       22                 16.68
5     Australia      8.55       19                 19.47
6       England      8.43       23                 14.09
7  South Africa      6.73       18                 12.33
8      Pakistan      5.76       18                 15.22
9   Netherlands      7.72       13                 22.23
Batting First Statistics:
           Team  Run Rate  Wickets  Avg Balls per Wicket
0   Afghanistan      9.09       18                 11.67
1     Sri Lanka      7.35       12                 12.25
2   New Zealand     11.87       16                 19.88
3         India      8.45       21                 12.38
4       England      8.50       14                 15.43
5    Bangladesh      5.06       14                 14.64
6   Netherlands      7.70       13                 16.54
7      Pakistan      5.97       12                 15.58
8  South Africa      7.05       11                 13.45
9     Australia      8.75       18                 17.94
Batting Second Statistics:
           Team  Run Rate  Wickets Avg Balls per Wicket
0    Bangladesh      5.46        3                22.33
1     Australia      7.15        1                 47.0
2  South Africa      6.08        7                10.57
3      Pakistan      5.31        6                 14.5
4     Sri Lanka      8.68        6                14.17
5       England      8.28        9                 12.0
6   New Zealand      6.20        3                29.33
7   Netherlands      7.78        0                  N/A
8   Afghanistan      7.67        3                14.33
9         India      6.95        1                107.0